# RebarIncludeFirstBar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarIncludeFirstBar Property
ParameterTypeId Class See Also
---
"Include First Bar"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarIncludeFirstBar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarIncludeFirstBar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarIncludeFirstBar {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace